Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputLayer (Flatten)         (None, 784)               0         
_________________________________________________________________
hiddenLayer1 (Dense)         (None, 350)               274750    
_________________________________________________________________
batch_normalization (BatchNo (None, 350)               1400      
_________________________________________________________________
hiddenLayer2 (Dense)         (None, 300)               105300    
_________________________________________________________________
dropout (Dropout)            (None, 300)               0         
_________________________________________________________________
hiddenLayer3 (Dense)         (None, 100)               30100     
_________________________________________________________________
outputLayer (Dense)          (None, 10)                1010      
=================================================================
Total params: 412,560
Trainable params: 411,860
Non-trainable params: 700
_________________________________________________________________