Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
InputLayer (Flatten)         (None, 784)               0         
_________________________________________________________________
HiddenLayer1 (Dense)         (None, 300)               235500    
_________________________________________________________________
HiddenLayer2 (Dense)         (None, 150)               45150     
_________________________________________________________________
OutputLayer (Dense)          (None, 10)                1510      
=================================================================
Total params: 282,160
Trainable params: 282,160
Non-trainable params: 0
_________________________________________________________________